Revit 2026 API

# ConcreteConcreteSealant Property

---

The property labeled "Sealant" from the "Concrete" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string ConcreteSealant { get; }
```
```vb
Public Shared ReadOnly Property ConcreteSealant As String
	Get
```
```cpp
public:
static property String^ ConcreteSealant {
	String^ get ();
}
```
```fsharp
static member ConcreteSealant : string with get
```

#### Property Value

String

This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "ConcreteSealantType".

#### Reference

Concrete Class

Autodesk.Revit.DB.Visual Namespace